Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test_Output/Output/Run/cassandra2-cql_workloada_600000_run_010518.txt
Datacenter: datacenter1; Host: localhost/127.0.0.1; Rack: rack1
[OVERALL], RunTime(ms), 322438.0
[OVERALL], Throughput(ops/sec), 1860.8228558668643
[TOTAL_GCS_PS_Scavenge], Count, 494.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1223.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.3792977254541959
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 494.0
[TOTAL_GC_TIME], Time(ms), 1223.0
[TOTAL_GC_TIME_%], Time(%), 0.3792977254541959
[READ], Operations, 276453.0
[READ], AverageLatency(us), 664.5123655738951
[READ], MinLatency(us), 252.0
[READ], MaxLatency(us), 2635775.0
[READ], 95thPercentileLatency(us), 678.0
[READ], 99thPercentileLatency(us), 1035.0
[READ], Return=OK, 276453
[READ], Return=NOT_FOUND, 23829
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 2247680.0
[CLEANUP], MinLatency(us), 2246656.0
[CLEANUP], MaxLatency(us), 2248703.0
[CLEANUP], 95thPercentileLatency(us), 2248703.0
[CLEANUP], 99thPercentileLatency(us), 2248703.0
[UPDATE], Operations, 299718.0
[UPDATE], AverageLatency(us), 406.869617440394
[UPDATE], MinLatency(us), 206.0
[UPDATE], MaxLatency(us), 63199.0
[UPDATE], 95thPercentileLatency(us), 487.0
[UPDATE], 99thPercentileLatency(us), 613.0
[UPDATE], Return=OK, 299718
[READ-FAILED], Operations, 23829.0
[READ-FAILED], AverageLatency(us), 416.1175038818247
[READ-FAILED], MinLatency(us), 224.0
[READ-FAILED], MaxLatency(us), 33119.0
[READ-FAILED], 95thPercentileLatency(us), 498.0
[READ-FAILED], 99thPercentileLatency(us), 661.0