Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test_Output/Output/Run/cassandra2-cql_workloadf_800000_run_010518.txt
Datacenter: datacenter1; Host: localhost/127.0.0.1; Rack: rack1
[OVERALL], RunTime(ms), 2139307.0
[OVERALL], Throughput(ops/sec), 373.95287352399635
[TOTAL_GCS_PS_Scavenge], Count, 1152.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 3036.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.1419151155023566
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 1152.0
[TOTAL_GC_TIME], Time(ms), 3036.0
[TOTAL_GC_TIME_%], Time(%), 0.1419151155023566
[READ], Operations, 762851.0
[READ], AverageLatency(us), 2534.786764387803
[READ], MinLatency(us), 224.0
[READ], MaxLatency(us), 3047423.0
[READ], 95thPercentileLatency(us), 4463.0
[READ], 99thPercentileLatency(us), 22495.0
[READ], Return=OK, 762851
[READ], Return=NOT_FOUND, 37149
[READ-MODIFY-WRITE], Operations, 399229.0
[READ-MODIFY-WRITE], AverageLatency(us), 2868.8189585425907
[READ-MODIFY-WRITE], MinLatency(us), 491.0
[READ-MODIFY-WRITE], MaxLatency(us), 2226175.0
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 4819.0
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 22319.0
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 2595840.0
[CLEANUP], MinLatency(us), 2594816.0
[CLEANUP], MaxLatency(us), 2596863.0
[CLEANUP], 95thPercentileLatency(us), 2596863.0
[CLEANUP], 99thPercentileLatency(us), 2596863.0
[UPDATE], Operations, 399229.0
[UPDATE], AverageLatency(us), 432.4901071815925
[UPDATE], MinLatency(us), 215.0
[UPDATE], MaxLatency(us), 404991.0
[UPDATE], 95thPercentileLatency(us), 533.0
[UPDATE], 99thPercentileLatency(us), 680.0
[UPDATE], Return=OK, 399229
[READ-FAILED], Operations, 37149.0
[READ-FAILED], AverageLatency(us), 444.55581576893053
[READ-FAILED], MinLatency(us), 226.0
[READ-FAILED], MaxLatency(us), 197247.0
[READ-FAILED], 95thPercentileLatency(us), 535.0
[READ-FAILED], 99thPercentileLatency(us), 660.0