Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test_Output/Output/Run/mongodb_workloada_200000_run_010518.txt
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
[OVERALL], RunTime(ms), 45982.0
[OVERALL], Throughput(ops/sec), 4349.528076203732
[TOTAL_GCS_PS_Scavenge], Count, 81.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 146.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.3175155495628724
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 81.0
[TOTAL_GC_TIME], Time(ms), 146.0
[TOTAL_GC_TIME_%], Time(%), 0.3175155495628724
[READ], Operations, 100189.0
[READ], AverageLatency(us), 165.93179890007886
[READ], MinLatency(us), 76.0
[READ], MaxLatency(us), 2250751.0
[READ], 95thPercentileLatency(us), 202.0
[READ], 99thPercentileLatency(us), 334.0
[READ], Return=OK, 100189
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 3477.0
[CLEANUP], MinLatency(us), 3476.0
[CLEANUP], MaxLatency(us), 3477.0
[CLEANUP], 95thPercentileLatency(us), 3477.0
[CLEANUP], 99thPercentileLatency(us), 3477.0
[UPDATE], Operations, 99811.0
[UPDATE], AverageLatency(us), 281.581198465099
[UPDATE], MinLatency(us), 121.0
[UPDATE], MaxLatency(us), 1823743.0
[UPDATE], 95thPercentileLatency(us), 286.0
[UPDATE], 99thPercentileLatency(us), 576.0
[UPDATE], Return=OK, 99811