Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test_Output/Output/Run/mongodb_workloada_400000_run_010518.txt
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
[OVERALL], RunTime(ms), 230687.0
[OVERALL], Throughput(ops/sec), 1733.9511979435338
[TOTAL_GCS_PS_Scavenge], Count, 22.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 485.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.2102415827506535
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 22.0
[TOTAL_GC_TIME], Time(ms), 485.0
[TOTAL_GC_TIME_%], Time(%), 0.2102415827506535
[READ], Operations, 200303.0
[READ], AverageLatency(us), 261.6602846687269
[READ], MinLatency(us), 75.0
[READ], MaxLatency(us), 5648383.0
[READ], 95thPercentileLatency(us), 241.0
[READ], 99thPercentileLatency(us), 367.0
[READ], Return=OK, 200303
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 4342.0
[CLEANUP], MinLatency(us), 4340.0
[CLEANUP], MaxLatency(us), 4343.0
[CLEANUP], 95thPercentileLatency(us), 4343.0
[CLEANUP], 99thPercentileLatency(us), 4343.0
[UPDATE], Operations, 199697.0
[UPDATE], AverageLatency(us), 881.3024732469692
[UPDATE], MinLatency(us), 120.0
[UPDATE], MaxLatency(us), 3.4635775E7
[UPDATE], 95thPercentileLatency(us), 319.0
[UPDATE], 99thPercentileLatency(us), 2137.0
[UPDATE], Return=OK, 199697