Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test_Output/Output/Run/mongodb_workloada_600000_run_010518.txt
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
[OVERALL], RunTime(ms), 528499.0
[OVERALL], Throughput(ops/sec), 1135.290700644656
[TOTAL_GCS_PS_Scavenge], Count, 48.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 7132.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 1.3494822128329478
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 48.0
[TOTAL_GC_TIME], Time(ms), 7132.0
[TOTAL_GC_TIME_%], Time(%), 1.3494822128329478
[READ], Operations, 300278.0
[READ], AverageLatency(us), 901.6192528257149
[READ], MinLatency(us), 84.0
[READ], MaxLatency(us), 5275647.0
[READ], 95thPercentileLatency(us), 296.0
[READ], 99thPercentileLatency(us), 3867.0
[READ], Return=OK, 300278
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 290176.0
[CLEANUP], MinLatency(us), 290048.0
[CLEANUP], MaxLatency(us), 290303.0
[CLEANUP], 95thPercentileLatency(us), 290303.0
[CLEANUP], 99thPercentileLatency(us), 290303.0
[UPDATE], Operations, 299722.0
[UPDATE], AverageLatency(us), 848.8613782104751
[UPDATE], MinLatency(us), 125.0
[UPDATE], MaxLatency(us), 3375103.0
[UPDATE], 95thPercentileLatency(us), 371.0
[UPDATE], 99thPercentileLatency(us), 4063.0
[UPDATE], Return=OK, 299722