Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test_Output/Output/Run/mongodb_workloadf_400000_run_010518.txt
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
[OVERALL], RunTime(ms), 155565.0
[OVERALL], Throughput(ops/sec), 2571.2724584578796
[TOTAL_GCS_PS_Scavenge], Count, 350.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 530.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.340693600745669
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 350.0
[TOTAL_GC_TIME], Time(ms), 530.0
[TOTAL_GC_TIME_%], Time(%), 0.340693600745669
[READ], Operations, 400000.0
[READ], AverageLatency(us), 229.593655
[READ], MinLatency(us), 79.0
[READ], MaxLatency(us), 8032255.0
[READ], 95thPercentileLatency(us), 211.0
[READ], 99thPercentileLatency(us), 321.0
[READ], Return=OK, 400000
[READ-MODIFY-WRITE], Operations, 200056.0
[READ-MODIFY-WRITE], AverageLatency(us), 539.3126624545127
[READ-MODIFY-WRITE], MinLatency(us), 204.0
[READ-MODIFY-WRITE], MaxLatency(us), 9543679.0
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 486.0
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 2875.0
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 42384.0
[CLEANUP], MinLatency(us), 42368.0
[CLEANUP], MaxLatency(us), 42399.0
[CLEANUP], 95thPercentileLatency(us), 42399.0
[CLEANUP], 99thPercentileLatency(us), 42399.0
[UPDATE], Operations, 200056.0
[UPDATE], AverageLatency(us), 305.810523053545
[UPDATE], MinLatency(us), 118.0
[UPDATE], MaxLatency(us), 9543679.0
[UPDATE], 95thPercentileLatency(us), 269.0
[UPDATE], 99thPercentileLatency(us), 2157.0
[UPDATE], Return=OK, 200056