Benchmarking-MongoDb-and-Cassandra-using-YCSB/Test_Output/Output/Run/mongodb_workloadf_600000_run_010518.txt
mongo client connection created with mongodb://localhost:27017/ycsb?w=1
[OVERALL], RunTime(ms), 401603.0
[OVERALL], Throughput(ops/sec), 1494.0127439287057
[TOTAL_GCS_PS_Scavenge], Count, 498.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 874.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.2176278563656148
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 498.0
[TOTAL_GC_TIME], Time(ms), 874.0
[TOTAL_GC_TIME_%], Time(%), 0.2176278563656148
[READ], Operations, 600000.0
[READ], AverageLatency(us), 547.042905
[READ], MinLatency(us), 76.0
[READ], MaxLatency(us), 3831807.0
[READ], 95thPercentileLatency(us), 250.0
[READ], 99thPercentileLatency(us), 2179.0
[READ], Return=OK, 600000
[READ-MODIFY-WRITE], Operations, 299570.0
[READ-MODIFY-WRITE], AverageLatency(us), 765.1287946056013
[READ-MODIFY-WRITE], MinLatency(us), 209.0
[READ-MODIFY-WRITE], MaxLatency(us), 3864575.0
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 533.0
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 2933.0
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 39280.0
[CLEANUP], MinLatency(us), 39264.0
[CLEANUP], MaxLatency(us), 39295.0
[CLEANUP], 95thPercentileLatency(us), 39295.0
[CLEANUP], 99thPercentileLatency(us), 39295.0
[UPDATE], Operations, 299570.0
[UPDATE], AverageLatency(us), 232.73671262142403
[UPDATE], MinLatency(us), 120.0
[UPDATE], MaxLatency(us), 2226175.0
[UPDATE], 95thPercentileLatency(us), 273.0
[UPDATE], 99thPercentileLatency(us), 448.0
[UPDATE], Return=OK, 299570